Config/Catalogs/КонтрольныеСоотношения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтрольныеСоотношения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказателиТекущегоОтчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСоотношения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дополнительное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПояснения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрольногоСоотношения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрольногоСоотношения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщенияФЛК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НедопустимоеФЛК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИзменятьПриЗагрузкеКомплекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ВидКонтрольногоСоотношения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидКонтрольногоСоотношения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Межформенное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутриформенное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЛК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольБК</Name>
					<Comment>Контроль бюджетной классификации</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/КонтрольныеСоотношения/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПравилоПроверкиПриИзменении(Элемент)
	УстановитьОтборКонтрольныхСоотношений();
КонецПроцедуры

&НаКлиенте
Процедура ТипСоотношенияПриИзменении(Элемент)
	
	ИспользоватьВидКС			= ТипСоотношения > 0;
		
	Если ИспользоватьВидКС Тогда
		Если ТипСоотношения = 1 ИЛИ ТипСоотношения = 2 Тогда
			ВидКС = ?(ТипСоотношения = 0, Ложь, Булево(ТипСоотношения-1));//Ложь - межформенное, Истина - внутиформенное
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ПоказателиТекущегоОтчета", ВидКС,,,Истина);
		    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидКонтрольногоСоотношения", ПредопределенноеЗначение("Перечисление.ВидКонтрольногоСоотношения.ФЛК"),ВидСравненияКомпоновкиДанных.НеРавно,,Истина);
		ИначеЕсли ТипСоотношения = 3 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ПоказателиТекущегоОтчета",,,,Ложь);
		    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидКонтрольногоСоотношения", ПредопределенноеЗначение("Перечисление.ВидКонтрольногоСоотношения.ФЛК"),ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ПоказателиТекущегоОтчета",,,,Ложь);
	    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидКонтрольногоСоотношения",,,,Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	УстановитьОтборКонтрольныхСоотношений();
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ОтборПоСпискуВидовОтчетов Тогда
		ОткрытьФорму("Справочник.ВидыОтчетов.ФормаВыбора",,ЭтаФорма,Истина,,,Новый ОписаниеОповещения("ОбработкаВыбораВидаОтчетаЗавершение",ЭтотОбъект));
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТипЗначения", Новый ОписаниеТипов("СправочникСсылка.ВидыОтчетов"));
		ПараметрыФормы.Вставить("Значение"   , ВидОтчета);
		ПараметрыФормы.Вставить("ПараметрыВыбораЗначения", Элемент.ПараметрыВыбора);
		
		ОткрытьФорму("Справочник.ОперандыПоказателей.Форма.РедактированиеСпискаЗначенийОтбора", ПараметрыФормы, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВидаОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ВидОтчета.Очистить();
		ВидОтчета.Добавить(Результат);
		УстановитьОтборКонтрольныхСоотношений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСпискуВидовОтчетовПриИзменении(Элемент)
	Если ОтборПоСпискуВидовОтчетов=0 Тогда
		Если ВидОтчета.Количество()>1 Тогда
			ТекВид = ВидОтчета[0].Значение;
			ВидОтчета.Очистить();
			ВидОтчета.Добавить(ТекВид);			
		КонецЕсли;
	КонецЕсли;
	УстановитьОтборКонтрольныхСоотношений();	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДействияПриИзменении(Элемент)
	УстановитьОтборКонтрольныхСоотношений();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборКонтрольныхСоотношений()

	ИспользоватьПравилоПроверки = ЗначениеЗаполнено(ПравилоПроверки);
	ИспользоватьВидОтчета       = ЗначениеЗаполнено(ВидОтчета);
	
	СписокСоотношений = Новый СписокЗначений;
	Если НЕ ИспользоватьПравилоПроверки И НЕ ИспользоватьВидОтчета Тогда
		Использование = Ложь;
	Иначе
		Использование = Истина;
		СписокСоотношений = Справочники.КонтрольныеСоотношения.ПолучитьСписокКонтрольныхСоотношений(ПравилоПроверки,ВидОтчета.ВыгрузитьЗначения(),ИспользоватьПравилоПроверки,ИспользоватьВидОтчета,?(ОтборПоСпискуВидовОтчетов=2,"Каждый","Любой"));
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Ссылка", СписокСоотношений, ВидСравненияКомпоновкиДанных.ВСписке,, Использование);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ДатаНачалаДействия", ДатаДействия, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,, ЗначениеЗаполнено(ДатаДействия));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ДатаОкончанияДействия", ДатаДействия, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, ЗначениеЗаполнено(ДатаДействия));

КонецПроцедуры // УстановитьОтборКонтрольныхСоотношений()

#КонецОбласти
